group-reports/sharif/results/100G-disk-throughput-tuning-protocol-B-sndbuf-2m/test-1.txt
read-sequentially-test-job: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
read-sequentially-test-job: Laying out IO file (1 file / 102400MiB)

read-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=96708: Sat Jul 15 15:58:38 2023
   read: IOPS=193, BW=775MiB/s (812MB/s)(454GiB/600076msec)
    slat (usec): min=32, max=679903, avg=3648.61, stdev=4085.58
    clat (msec): min=25, max=931, avg=78.98, stdev=20.47
     lat (msec): min=25, max=935, avg=82.63, stdev=20.66
    clat percentiles (msec):
     |  1.00th=[   69],  5.00th=[   73], 10.00th=[   75], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   78], 50.00th=[   78], 60.00th=[   80],
     | 70.00th=[   81], 80.00th=[   82], 90.00th=[   83], 95.00th=[   84],
     | 99.00th=[   96], 99.50th=[  117], 99.90th=[  388], 99.95th=[  625],
     | 99.99th=[  885]
   bw (  KiB/s): min=65405, max=868352, per=100.00%, avg=794312.92, stdev=57290.30, samples=1198
   iops        : min=   15, max=  212, avg=193.88, stdev=14.00, samples=1198
  lat (msec)   : 50=0.52%, 100=98.55%, 250=0.77%, 500=0.09%, 750=0.04%
  lat (msec)   : 1000=0.03%
  cpu          : usr=0.19%, sys=2.20%, ctx=129401, majf=0, minf=556
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=116193,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=775MiB/s (812MB/s), 775MiB/s-775MiB/s (812MB/s-812MB/s), io=454GiB (487GB), run=600076-600076msec

Disk stats (read/write):
    drbd1: ios=929454/6, merge=0/0, ticks=55986055/129, in_queue=55986184, util=100.00%, aggrios=929598/7, aggrmerge=0/0, aggrticks=56005264/129, aggrin_queue=56005393, aggrutil=100.00%
    dm-0: ios=929598/7, merge=0/0, ticks=56005264/129, in_queue=56005393, util=100.00%, aggrios=929563/7, aggrmerge=35/0, aggrticks=55591671/130, aggrin_queue=55127132, aggrutil=100.00%
  sde: ios=929563/7, merge=35/0, ticks=55591671/130, in_queue=55127132, util=100.00%